# Directory to install
cask_args appdir: '/Applications'

tap 'homebrew/cask'

#  formulae
brew "zsh"
brew "git"
brew "tree"
brew "gh"
brew "oh-my-posh"
brew "antidote"
brew "nvm"


# casks
cask "font-fira-code"
cask "visual-studio-code"
cask "wezterm"
cask "rectangle"
cask "bitwarden"
cask "firefox"
cask "spotify"
cask "obsidian"