# Directory to install
cask_args appdir: '/Applications'

tap 'homebrew/cask'

#  formulae
brew "zsh"
brew "git"
brew "tree"
brew "gh"
brew "oh-my-posh"
brew "antidote"
brew "nvm"


# casks
cask "font-fira-code"
cask "visual-studio-code"
cask "wezterm"
cask "rectangle"
cask "bitwarden"
cask "firefox"
cask "spotify"
cask "obsidian"

# vscode extensions
vscode "astro-build.astro-vscode"
vscode "avetis.neutron-palette"
vscode "beardedbear.beardedicons"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "tamasfe.even-better-toml"
vscode "yzhang.markdown-all-in-one"